{
  "folders": [
    {
      "type": "folder",
      "name": "新しいフォルダ",
      "children": [
        {
          "type": "memo",
          "name": "ああああああ - コピー",
          "content": "あああああああ"
        },
        {
          "type": "memo",
          "name": "ああああああ",
          "content": "あああああああ"
        },
        {
          "type": "folder",
          "name": "下の階層",
          "children": []
        }
      ]
    },
    {
      "type": "memo",
      "name": "メモ帳　修正箇所",
      "content": "今度は問題なく、ボタンが機能するようになりましが、機能しない部分もあります。\n\n以下が修正点です\n\n\n1. キーワード検索が機能しない\n2. 変換が \nエンコード、デコード、コメント削除、1文、カスタム、が1行で表示されてしまい、確認ボタンを押しても、変換される場所が表示されず、変換ボタンを押しても変換されない\n3.  インポートの候補について、現在は候補ボタンを押すと\n\n←戻る　　　　　　　　保存\n\n候補編集\n\n名前\n入力欄\nURL\n入力欄\n追加　削除　↑　↓\n\n\n\nと表示されるが、そもそもロジックに問題があるため、候補ボタンを押したら以下のように機能・UIを変更してほしい\n\n\n\n\n←戻る　　　　　　　　編集\n\n\n\n候補一覧\n\n\n候補名1\n候補名2\n候補目3\n\n\n\n\n(編集ボタンを押すと)\n\n\n←戻る　　　　　　　　　　　　　　　保存\n\n\n候補編集\n\n\n候補名 入力欄 URL 入力欄 追加 削除 ↑ ↓\n\n\n\n\n(説明)\n\n\nインポートの候補ボタンを押したら、まずは候補一覧を表示してほしい。候補一覧の下には候補名を一覧で表示し、候補名をクリックすると保存されたURLでインポートされる。編集ボタンを押すと、候補名とURLを編集でき、追加ボタンでその下に未入力の状態で追加され、削除ボタンを押すと削除される。↑↓ボタンで順番を並び替えられる。\n候補名 入力欄 URL 入力欄 追加 削除 ↑ ↓\nこれを1列に並ぶようにして、追加・削除・↑・↓で並び替えをしやすくしてほしい。\nそして、保存ボタンを押すと、GitHub上のJSONファイルにも保存され、候補一覧の画面に戻るようにしてほしい。\n編集画面で←戻るを押した場合は、この変更は保存されず、候補一覧の画面に戻るようにしてほしい。\nつまり、候補の中身がGitHub上のJSONファイルと同期されるようにするため\n・インポートの候補ボタンをクリックでGitHub上のJSONファイルを読み込んで候補一覧を表示\n・候補の編集画面から保存ボタンを押したら、GitHub上のJSONファイルに上書きして、候補一覧画面に戻る\nこの手順を踏んで、候補の中身がGitHub上のJSONファイルと同期されるようにしてほしい\n\n\n\n\n4. メモ一覧について\n\n\n・一時メモは、他のメモとは独立した階層にあるので、メモ一覧の表示でも、他のメモと少し離して表示してほしい\n・編集について、フォルダを選択して表示する階層を移動することはできるが、メモを移動する際に、階層を移動してメモを移動することができない。\n・フォルダ作成について、これからは編集からフォルダを作成できるようにしてほしい。フォルダ作成を押すと、現在表示されている階層にフォルダが作成される\nまた、保存ボタンの表示や、GitHubのJSONファイルへの同期のタイミングを変更したい\nまずメモ一覧を開いたら、この時点でGitHubのJSONファイルを読み込むようにしてください。現在はページをリロードしないとJSONファイルが再読み込みされませんが、これからは、メモ一覧を開くたびに、GitHubのJSONファイルを読み込むようにしてください。\n\n\nそしてメモ一覧を開くと\n\n\n←戻る　　　　　　　　　　編集\n\n\n(例)\n📁フォルダ1\n📁フォルダ2\n📋️メモ1\n📋️メモ2\n📋️メモ3\n\n\n📋️一時メモ  (離して表示)\n\n\n\n\n\n\nこのように表示します。そして編集ボタンを押すと編集画面に遷移します\n\n\n\n\n←戻る　　　　　　　　　　　　　保存\n\n\n編集中\n\n\n(例)\n📁 .. (上の階層へ)\n📁フォルダ1\n📁フォルダ2\n📋️メモ1\n📋️メモ2\n📋️メモ3\n\n\n→下の階層へ\nコピー 削除\n入力欄　　　変更\n\n\n\n\nこのように表示してください。\n貼り付け(終了)ボタンは不要なので廃止します\n📁 .. (上の階層へ)　を押すと上の階層に移動します\nメモやフォルダを押すと選択された状態になり\n選択された状態で、移動を押すと移動モードになり、コピーを押すと下にコピーが表示され、削除ボタンを押すと削除されます。\nそして、その下の入力欄にフォルダ名またはメモのタイトルが表示され、入力欄で変更し、変更ボタン押すことで名称の変更が反映されます\nフォルダをクリックして選択した時のみ、→下の階層へ　を表示してください。→下の階層へ　を押すと、そのフォルダの下の階層に移動します。\n\n\nコピーについて\n\n\nクリックして選択されているメモ・フォルダが対象です。\n選択されているメモ・フォルダの下にコピーを追加します。\nフォルダの場合は、そのフォルダの、それより下の全ての階層のフォルダ・メモも追加されるようにしてください\n\n\n\n\n削除について\n\n\nクリックして選択されているメモ・フォルダが対象です。\n選択されているメモ・フォルダが削除されます。\nフォルダの場合は、そのフォルダの、それより下の全ての階層のフォルダ・メモも削除されるようにしてください\n\n\n\n\n移動について\n\n\n移動は、これからはスマホ・PC両対応で、選択された状態から、左クリックマウス移動または長押し移動でドラッグアンドドロップで並び替えできるようにしてほしい\nメモとフォルダやフォルダとフォルダの並び替えは、エクスプローラーのように、移動中にフォルダにぶつかったときに、[フォルダ名]へ移動と表示して、それが表示された状態で指を離すとそのフォルダに移動し、その階層に表示されるようにしてほしい。📁\n .. \n(上の階層へ)にドラッグアンドドロップしたら、上の階層に移動し、その階層に表示されるようにしてほしい。このように直感的にメモ・フォルダを移動できるようにしてほしい。\n\n\n\n\n編集画面の　←戻る　と　保存について　　（重要）\n\n\n編集画面の　←戻る　を押したら、編集画面での変更は一切保存せずにメモ一覧画面に戻るようにしてください。\n保存ボタンを押すと、編集画面での変更がGitHubのJSONファイルに同期されてメモ一覧画面に戻るようにしてください。\n保存ボタンを押すことで、変更が同期されて保存されるようになります。←戻る　ではJSONファイルに同期されず、変更は保存されないようにして下さい。\n\n\n\n\n\n\nメモ保存は、問題なく動作するので今のまま継続してください\n\n\n\n\n\n\n5. 実行の隣の+ボタンについて、これからは、この+ボタンを押したら新しいタブで\nhttps://gadget-otaku.github.io/Bookmarklet/%E3%83%A1%E3%83%A2%E5%B8%B32.0\n\nを開いてほしい。バージョンが決まり次第、後で自分でURLを変更する予定なので、とりあえずこのURLで新しいタブで開くようにしてほしい\n\n\n\n\nこれらを修正して下さい"
    }
  ],
  "tempMemo": "さあいくぞ",
  "candidates": [
    {
      "name": "",
      "url": ""
    }
  ]
}